src/cf/src/Documents/ВыпускПродукции/ВыпускПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыпускПродукции</name>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <registerRecords>AccumulationRegister.ДополнительныеРасходы</registerRecords>
  <registerRecords>InformationRegister.ЦеныНоменклатуры</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВНаличии</registerRecords>
  <registerRecords>AccumulationRegister.ПотребностиПроизводства</registerRecords>
  <attributes>
    <name>Количество</name>
    <type>
      <types>DefinedType.КоличествоНеотрицательное</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <type>
      <types>DefinedType.КоличествоНеотрицательное</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияОприходование</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.ПроизводственноеОборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>Оператор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданАвтоматически</name>
    <comment>Выпуск создан механизмом автовыпуска, а не пользователем: правится только проведением своего основания</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаРозничная</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DefinedType.ПриходныйДокументПартии</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Себестоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЗаЕдиницу</name>
      <type>
        <types>DefinedType.НормаРасхода</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧСерии</name>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧГотоваяПродукция</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <dimensions>
    <name>ТоварнаяГруппа</name>
    <type>
      <types>CatalogRef.ТоварныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/AccumulationRegisters/ПотребностиПроизводства/ПотребностиПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПотребностиПроизводства</name>
  <resources>
    <name>Потребность</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Заказано</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Пришло</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>ИзОстатка</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Материал</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/Documents/ВыпускПродукции/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	РаботаСДокументами.ЗаполнитьРеквизитыПоУмолчанию(ЭтотОбъект);
	// «Выпуск по заказу» рабочего места производства (E12.3).
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		Документы.ВыпускПродукции.ЗаполнитьПоЗаказу(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	УстановитьПривилегированныйРежим(Истина);
	РаботаСДокументами.УстановитьЗаписьВсехРегистров(Движения);
	// Данные для проведения
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ТЗТоварыССериями", СерииИРазмещение.ОбъединитьТоварыССериями(ЭтотОбъект));
	// Блокировки
	Блокировка = Новый БлокировкаДанных;
	ЗаполнитьБлокировкуПроведения(Блокировка);
	Блокировка.Заблокировать();
	// Формируем
	Отказ = Не РегистрыНакопления.ТоварыВНаличии.СформироватьДвижения(ЭтотОбъект);
	Если Отказ Тогда Возврат КонецЕсли;
	Если ЗначениеЗаполнено(ЦенаРозничная) И ТЧГотоваяПродукция.Количество() = 1 Тогда 
		НС = Движения.ЦеныНоменклатуры.Добавить();
		НС.Период = Дата;
		НС.ВидЦены = Справочники.ВидыЦен.Розничная;
		НС.Номенклатура = Номенклатура;
		НС.Характеристика = Характеристика;
		НС.ТоварнаяГруппа = Номенклатура.ТоварнаяГруппа;
		НС.Цена = ЦенаРозничная;
	КонецЕсли;
	// «ИзОстатка» автовыпуска при отгрузке: материалы, не покрытые партиями под заказ (E9)
	Если Производство.ЭтоАвтовыпуск(ЭтотОбъект) Тогда
		РегистрыНакопления.ПотребностиПроизводства.СформироватьДвижения(ЭтотОбъект);
	КонецЕсли;
	// Записываем
	Движения.Записать();
	ПроизводственныеЗаказы.ОбновитьСтадииПослеПроведения(ЭтотОбъект);
КонецПроцедуры

// Отмена проведения документа, затронувшего заказы клиента на производство: блокировки в порядке проведения,
// очистка движений и пересчёт стадий заказов (E8). Без таких заказов движения удаляет платформа, как раньше.
//
// Параметры:
//  Отказ - Булево - не используется.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	Блокировка = Новый БлокировкаДанных;
	ЗаполнитьБлокировкуПроведения(Блокировка);
	ПроизводственныеЗаказы.ОтменитьПроведениеДокумента(ЭтотОбъект, Блокировка);
КонецПроцедуры

// Блокировки проведения и отмены проведения - один набор в одном порядке (E8).
//
// Параметры:
//  Блокировка - БлокировкаДанных - заполняемая блокировка.
//
Процедура ЗаполнитьБлокировкуПроведения(Блокировка)
	УправляемыеБлокировки.ТоварыВНаличии(Блокировка, ТЧТовары);
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = ПараметрыСеанса.Пользователь;
	// Копия автовыпуска - ручной выпуск по заказу реализации (E9): признак снимается, иначе копия осталась бы
	// неправимой, а механизм её никогда не перезаполнил бы - он ищет свои выпуски по основанию.
	// Заказ считается до снятия признака: ЗаказРеализацииОснования читает ещё не очищенное основание.
	Если Производство.ЭтоАвтовыпуск(ЭтотОбъект) Тогда
		Основание = Производство.ЗаказРеализацииОснования(Основание);
		СозданАвтоматически = Ложь;
		Комментарий = "";
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	// Выпускаемая продукция задаётся либо шапкой (одна позиция), либо строками
	// ТЧГотоваяПродукция (мультивыпуск) - обязательно заполнение одного из двух.
	Если ТЧГотоваяПродукция.Количество() = 0 Тогда
		УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "ТЧГотоваяПродукция");
	Иначе
		УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Номенклатура");
		УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "КоличествоУпаковок");
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	// Автовыпуск меняет только проведение реализации (E9).
	Производство.ПроверитьПравкуАвтовыпуска(ЭтотОбъект, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	// Автовыпуск: модуль Производство проверяет закрытый период до записи - здесь проверка пройдёт так же.
	РаботаСДокументами.МожноРедактироватьДокумент(ЭтотОбъект, Отказ);
	СинхронизироватьГотовуюПродукцию();
	Если Не Отказ Тогда
		ПроизводственныеЗаказы.ЗапомнитьЗаказыДокумента(ЭтотОбъект, РежимЗаписи);
	КонецЕсли;
КонецПроцедуры

// Автовыпуск удаляется механизмом или, непроведённый и помеченный, удалением помеченных (E9).
//
// Параметры:
//  Отказ - Булево - устанавливается при удалении иного автовыпуска.
//
Процедура ПередУдалением(Отказ)
	Если ОбменДанными.Загрузка Или Не Проведен И ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	Производство.ПроверитьПравкуАвтовыпуска(ЭтотОбъект, Отказ);
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	РаботаСДокументами.ОбновитьПроизводственныйСтатусЗаказа(ЭтотОбъект);
	// Проведённый документ, перезаписанный без перепроведения, пересчитывает стадии своих заказов (E8).
	ПроизводственныеЗаказы.ОбновитьСтадииПриЗаписи(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СинхронизироватьГотовуюПродукцию()
	// Источник данных проведения - ТЧГотоваяПродукция; шапка хранит первую позицию для
	// списков, печатных форм и розничной цены. Одна позиция (или пустая ТЧ) - строка
	// перестраивается из шапки; несколько - шапка повторяет первую строку.
	ИменаРеквизитов = "Номенклатура, Характеристика, Серия, Упаковка, КоличествоУпаковок, Количество";
	Если ТЧГотоваяПродукция.Количество() <= 1 И ЗначениеЗаполнено(Номенклатура) Тогда
		ТЧГотоваяПродукция.Очистить();
		НоваяСтрока = ТЧГотоваяПродукция.Добавить();
		НоваяСтрока.КодСтроки = 1;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭтотОбъект, ИменаРеквизитов);
		Возврат;
	КонецЕсли;
	Если ТЧГотоваяПродукция.Количество() > 0 Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ТЧГотоваяПродукция[0], ИменаРеквизитов);
	КонецЕсли;
КонецПроцедуры

Процедура УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, Имя)
	Элемент = ПроверяемыеРеквизиты.Найти(Имя);
	Если Элемент <> Неопределено Тогда
		ПроверяемыеРеквизиты.Удалить(Элемент);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
